## Terraform apply  [job](https://circleci.com/gh/fr123k/kube-hetzner/158) 75ba79e59bc49e5537ab499272e79f8e8b89cb15 :x:

Error Summary:

```bash
Error: file provisioner error
```

<details>
    <summary>Show Details:</summary>

```bash

Initializing the backend...

Successfully configured the backend "http"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hetznercloud/hcloud from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Installing hetznercloud/hcloud v1.33.1...
- Installed hetznercloud/hcloud v1.33.1 (signed by a HashiCorp partner, key ID 5219EACB3A77198B)
- Installing hashicorp/random v3.1.2...
- Installed hashicorp/random v3.1.2 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Acquiring state lock. This may take a few moments...
random_password.k3s_token: Refreshing state... [id=none]
hcloud_network.k3s: Refreshing state... [id=1546887]
hcloud_ssh_key.default: Refreshing state... [id=6113063]
hcloud_network_subnet.k3s: Refreshing state... [id=1546887-10.0.0.0/16]
hcloud_firewall.k3s: Refreshing state... [id=362128]
hcloud_server.first_control_plane: Refreshing state... [id=19580572]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # hcloud_firewall.k3s has changed
  ~ resource "hcloud_firewall" "k3s" {
        id     = "362128"
        name   = "k3s-firewall"
        # (1 unchanged attribute hidden)

      - apply_to {
          - server = 19580232 -> null
        }
      + apply_to {
          + server = 19580572
        }

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.agents[0] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.4"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.agents[1] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-agent-1"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.5"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.control_planes[0] will be created
  + resource "hcloud_server" "control_planes" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 362128,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "fsn1"
      + name                       = "k3s-control-plane-1"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = [
          + "6113063",
        ]
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.3"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

  # hcloud_server.first_control_plane is tainted, so must be replaced
-/+ resource "hcloud_server" "first_control_plane" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "fsn1-dc14" -> (known after apply)
      ~ id                         = "19580572" -> (known after apply)
      ~ ipv4_address               = "49.12.186.94" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:1c17:d1bc::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:1c17:d1bc::/64" -> (known after apply)
        name                       = "k3s-control-plane-0"
      ~ status                     = "running" -> (known after apply)
        # (12 unchanged attributes hidden)

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.0.2" -> null
          - mac_address = "86:00:00:0b:a3:a4" -> null
          - network_id  = 1546887 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = "10.0.0.2"
          + mac_address = (known after apply)
          + network_id  = 1546887
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + agents_public_ip        = [
      + (known after apply),
      + (known after apply),
    ]
  + controlplanes_public_ip = [
      + (known after apply),
      + (known after apply),
    ]
hcloud_server.first_control_plane: Destroying... [id=19580572]
hcloud_server.first_control_plane: Destruction complete after 0s
hcloud_server.first_control_plane: Creating...
hcloud_server.first_control_plane: Still creating... [10s elapsed]
hcloud_server.first_control_plane: Provisioning with 'file'...
hcloud_server.first_control_plane: Still creating... [20s elapsed]
hcloud_server.first_control_plane: Still creating... [30s elapsed]
hcloud_server.first_control_plane: Still creating... [40s elapsed]
hcloud_server.first_control_plane: Still creating... [50s elapsed]
hcloud_server.first_control_plane: Still creating... [1m0s elapsed]
hcloud_server.first_control_plane: Still creating... [1m10s elapsed]
hcloud_server.first_control_plane: Still creating... [1m20s elapsed]
hcloud_server.first_control_plane: Still creating... [1m30s elapsed]
hcloud_server.first_control_plane: Still creating... [1m40s elapsed]
hcloud_server.first_control_plane: Still creating... [1m50s elapsed]
hcloud_server.first_control_plane: Still creating... [2m0s elapsed]
hcloud_server.first_control_plane: Still creating... [2m10s elapsed]
hcloud_server.first_control_plane: Still creating... [2m20s elapsed]
hcloud_server.first_control_plane: Still creating... [2m30s elapsed]
hcloud_server.first_control_plane: Still creating... [2m40s elapsed]
hcloud_server.first_control_plane: Still creating... [2m50s elapsed]
hcloud_server.first_control_plane: Still creating... [3m0s elapsed]
hcloud_server.first_control_plane: Still creating... [3m10s elapsed]
hcloud_server.first_control_plane: Still creating... [3m20s elapsed]
hcloud_server.first_control_plane: Still creating... [3m30s elapsed]
hcloud_server.first_control_plane: Still creating... [3m40s elapsed]
hcloud_server.first_control_plane: Still creating... [3m50s elapsed]
hcloud_server.first_control_plane: Still creating... [4m0s elapsed]
hcloud_server.first_control_plane: Still creating... [4m10s elapsed]
hcloud_server.first_control_plane: Still creating... [4m20s elapsed]
hcloud_server.first_control_plane: Still creating... [4m30s elapsed]
hcloud_server.first_control_plane: Still creating... [4m40s elapsed]
hcloud_server.first_control_plane: Still creating... [4m50s elapsed]
hcloud_server.first_control_plane: Still creating... [5m0s elapsed]
hcloud_server.first_control_plane: Still creating... [5m10s elapsed]

Error: file provisioner error

  with hcloud_server.first_control_plane,
  on master.tf line 16, in resource "hcloud_server" "first_control_plane":
  16:   provisioner "file" {

timeout - last error: dial tcp 49.12.186.81:22: i/o timeout
Releasing state lock. This may take a few moments...

```
</details>

<!-- github-comment: {"JobID":"fec70f4f-e619-4887-ac51-f16d1df96b08","JobName":"terraform-apply","SHA1":"75ba79e59bc49e5537ab499272e79f8e8b89cb15","TemplateKey":"plan","Vars":{}} -->